; Example ability template localization.

; Example weapon template localization.
;
; [BattleScanner X2WeaponTemplate]
; FriendlyName="Battle Scanner"
; FriendlyNamePlural="Battle Scanners"
; BriefSummary="The Battle Scanner provides extra vision on the battlefield. Soldiers deploy it like a grenade, throwing it to a hidden area of the map that they want to reveal. Any hidden or disguised enemies will be revealed as well."
; TacticalText="<Bullet/> Battle Scanners reveal an area hidden by the \"fog of war\" for multiple turns.\n<Bullet/> Battle Scanners also reveal hidden or disguised enemies."
; AbilityDescName="shotgun"

; Example schematic template localization.
;
; [ClausMecShotgun_CV_Schematic X2SchematicTemplate]
; m_strClassLabel="RANGER"

; Example item template localization.
;
; [IRI_AuroraShard X2ItemTemplate]
; FriendlyName = "Aurora Shard"
; FriendlyNamePlural = "Aurora Shards"
; BriefSummary = "Can be used in the Psi Lab to infuse a soldier without The Gift with psionic abilities."

; Example ammo template localization.
;
; [IRI_Ammo_Sabot X2AmmoTemplate]
; FriendlyName="Sabot Rounds"
; FriendlyNamePlural="Sabot Rounds"
; BriefSummary="These arrow-shaped sub-caliber rounds use discarding sabot to accelerate to hypersonic speeds, making them vastly more effective at long range, and harder for enemies to avoid."
; TacticalText="These arrow-shaped sub-caliber rounds use discarding sabot to accelerate to hypersonic speeds, making them vastly more effective at long range, and harder for enemies to avoid.<br/><bullet> Squadsight penalties to Aim and Crit are reduced by <Ability:IRI_SABOT_AMMO_COUNTER_SQUADSIGHT/>.<br/><bullet> <Ability:IRI_SABOT_AMMO_COUNTER_DODGE/> of the target's natural Dodge is ignored.<br><Bullet/> <Ability:IRI_SABOT_AMMO_COUNTER_DEFENSE/> of the target's natural Defense is ignored. <br><Bullet/> Squadsight normally applies <Ability:IRI_SABOT_AMMO_SQUADSIGHT_AIM/> Aim penalty per tile and <Ability:IRI_SABOT_AMMO_SQUADSIGHT_CRIT/> Crit penalty."

; Example tech template localization.
;
; [IRI_ImprovedShells_Tech X2TechTemplate]
; DisplayName="Improved Heavy Cannon Shells"
; Summary="Upgrade and revise our entire arsenal of special Heavy Cannon shells to improve them wherever possible."

; Example weapon upgrade template localization.
; 
; [IRI_ExperimentalMagazine_Upgrade X2WeaponUpgradeTemplate]
; FriendlyName="Experimental Magazine"
; FriendlyNamePlural="Experimental Magazines"
; BriefSummary="Grants an Ammo Slot."
; TinySummary="Grants an Ammo Slot."
; LootTooltip="This weapon upgrade will allow equipping special ammo without occupying a utility slot. It will have no effect if the unit already has an Ammo Slot."

[Zero_ArmedToTheTeeth X2AbilityTemplate]
LocFriendlyName="重装上阵"
LocLongDescription="允许士兵装备榴弹发射器，并增加齐射和爆炸挥发技能。"
LocHelpText="允许士兵装备榴弹发射器，并能异常熟练地使用它"
LocPromotionPopupText="<Bullet/> 装备榴弹发射器。<br/><Bullet/> 提供齐射和爆炸挥发技能<br/>"
LocFlyOverText="爆炸！"

[ZeroPoisonImmunity X2AbilityTemplate]
LocFriendlyName="毒素免疫"
LocLongDescription="这名士兵对毒素免疫。"
LocHelpText="这名士兵对毒素免疫"
LocPromotionPopupText="免疫毒素"
LocFlyOverText="免疫"

[ZeroFrostImmunity X2AbilityTemplate]
LocFriendlyName="冰冻免疫"
LocLongDescription="这名士兵对冰冻效果免疫。"
LocHelpText="这名士兵对冰冻效果免疫"
LocPromotionPopupText="免疫冰冻"
LocFlyOverText="免疫"

[ZeroAcidImmunity X2AbilityTemplate]
LocFriendlyName="酸蚀免疫"
LocLongDescription="这名士兵对酸蚀免疫。"
LocHelpText="这名士兵对酸蚀免疫"
LocPromotionPopupText="免疫酸蚀"
LocFlyOverText="免疫"

[ZeroFireImmunity X2AbilityTemplate]
LocFriendlyName="火焰免疫"
LocLongDescription="这名士兵对火焰免疫。"
LocHelpText="这名士兵对火焰免疫"
LocPromotionPopupText="免疫火焰"
LocFlyOverText="免疫"

[Zero_Playmaker X2AbilityTemplate]
LocFriendlyName="策略高手"
LocLongDescription="授予一个免费的闪光弹和快速部署技能。"
LocHelpText="授予闪光弹和快速部署能力"
LocPromotionPopupText="<Bullet/> 授予闪光弹能力。<br/><Bullet/> 提供快速部署能力<br/>"
LocFlyOverText="爆炸！"